# Operations

In [1]:
import pandas as pd

In [4]:
# Creating a sample DataFrame

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 50000, 60000, 70000, 80000]
}
df = pd.DataFrame(data)

In [6]:
df.head()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Alice   25   50000
4      Bob   30   60000

## Unique Values
Pandas allows you to find unique values and count occurrences in a column.

In [9]:
# Finding unique values in 'Name' column
unique_names = df['Name'].unique()

In [11]:
unique_names

array(['Alice', 'Bob', 'Charlie', 'David'], dtype=object)

### Counting unique values

In [ ]:
display(df['Name'].nunique())

### Value Counts
Counting occurrences of each value in 'Name' column

In [13]:
name_counts = df['Name'].value_counts()

In [15]:
name_counts

Name
Alice      2
Bob        2
Charlie    2
David      1
Name: count, dtype: int64

In [17]:
display(unique_names, name_counts)

array(['Alice', 'Bob', 'Charlie', 'David'], dtype=object)

Name
Alice      2
Bob        2
Charlie    2
David      1
Name: count, dtype: int64

### Finding the number of unique values: 
you could only check the length of the array

In [21]:
df['Name'].apply(len)

0    5
1    3
2    7
3    5
4    3
5    7
6    5
Name: Name, dtype: int64

## Selecting Data
We can select specific rows and columns from the DataFrame.

### Selecting a single column

In [36]:
display(df['Age'])

0    25
1    30
2    35
3    25
4    30
5    35
6    40
Name: Age, dtype: int64

### Selecting multiple columns

In [41]:
display(df[['Name', 'Salary']])

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    Alice   50000
4      Bob   60000
5  Charlie   70000
6    David   80000

### Selecting a specific row using `.iloc`

In [50]:
display(df.iloc[2])

Name      Charlie
Age            35
Salary      70000
Name: 2, dtype: object